a5021/STM32F401CCU6-Blink-Bare-Metal/inc/main.h
    0 * RCC_CFGR_PPRE2               | /*  0x0000E000 PRE2[2:0] bits (APB2 prescaler)            */
    0 * RCC_CFGR_PPRE2_0             | /*    0x00002000                                          */
    0 * RCC_CFGR_PPRE2_1             | /*    0x00004000                                          */
    0 * RCC_CFGR_PPRE2_2             | /*    0x00008000                                          */
    1 * RCC_CFGR_PPRE2_DIV1          | /*    HCLK not divided                                    */
    0 * RCC_CFGR_PPRE2_DIV2          | /*    HCLK divided by 2                                   */
    0 * RCC_CFGR_PPRE2_DIV4          | /*    HCLK divided by 4                                   */
    0 * RCC_CFGR_PPRE2_DIV8          | /*    HCLK divided by 8                                   */
    0 * RCC_CFGR_PPRE2_DIV16         | /*    HCLK divided by 16                                  */

    0 * RCC_CFGR_RTCPRE              | /*  0x001F0000                                            */
    0 * RCC_CFGR_RTCPRE_0            | /*    0x00010000                                          */
    0 * RCC_CFGR_RTCPRE_1            | /*    0x00020000                                          */
    0 * RCC_CFGR_RTCPRE_2            | /*    0x00040000                                          */
    0 * RCC_CFGR_RTCPRE_3            | /*    0x00080000                                          */
    0 * RCC_CFGR_RTCPRE_4            | /*    0x00100000                                          */

    0 * RCC_CFGR_MCO1                | /*  0x00600000                                            */
    0 * RCC_CFGR_MCO1_0              | /*    0x00200000                                          */
    0 * RCC_CFGR_MCO1_1              | /*    0x00400000                                          */

    0 * RCC_CFGR_I2SSRC              | /*  0x00800000                                            */

    0 * RCC_CFGR_MCO1PRE             | /*  0x07000000                                            */
    0 * RCC_CFGR_MCO1PRE_0           | /*    0x01000000                                          */
    0 * RCC_CFGR_MCO1PRE_1           | /*    0x02000000                                          */
    0 * RCC_CFGR_MCO1PRE_2           | /*    0x04000000                                          */

    0 * RCC_CFGR_MCO2PRE             | /*  0x38000000                                            */
    0 * RCC_CFGR_MCO2PRE_0           | /*    0x08000000                                          */
    0 * RCC_CFGR_MCO2PRE_1           | /*    0x10000000                                          */
    0 * RCC_CFGR_MCO2PRE_2           | /*    0x20000000                                          */

    0 * RCC_CFGR_MCO2                | /*  0xC0000000                                            */
    0 * RCC_CFGR_MCO2_0              | /*    0x40000000                                          */
    0 * RCC_CFGR_MCO2_1                /*    0x80000000                                          */
  );
                                                                              /*
                Wait till System clock is ready
                ===============================                               */

  while((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL) { /*  */ }
                                                                              /*
                   Configure SysTick timer
   By default the clock source of SysTick is AHB/8 = 12.5 MHz.
   ===========================================================                */

  SysTick->LOAD = 12500UL - 1;                /* set reload register */
  SysTick->VAL  = 1000UL - 1;                 /* load counter value  */
  SysTick->CTRL = SysTick_CTRL_ENABLE_Msk;    /* start SysTick timer */

}

__STATIC_INLINE void init_gpio(void) {

  #ifdef __clang__
    #pragma clang diagnostic push
    #pragma clang diagnostic ignored "-Wcast-align"
  #endif
                                                                              /*
                Configure aternate functions of GPIOA
                =====================================                         */
  
  *(volatile uint64_t *)&GPIOA->AFR = (
    PIN_AF(PIN(14),  AF(0))             | /* PA14:  AF0 SYS_SWDCLK            */
    PIN_AF(PIN(13),  AF(0))             | /* PA13:  AF0 SYS_SWDIO             */
    PIN_AF(PIN(11),  AF(8))               /* PA11:  AF8 USART6_TX             */
  );
  
  #if defined(__clang__) 
    #pragma clang diagnostic pop 
  #endif
                                                                              /*
                 Set mode for each ping of GPIOA
                 ===============================                              */

  GPIOA->MODER = ALL_ANALOG - (
#ifndef SWD_DISABLED
    PIN_CONF(PIN(14), PINV_ALT_FUNC)    | /* PA14 AF0 -- SYS_SWDCLK           */
    PIN_CONF(PIN(13), PINV_ALT_FUNC)    | /* PA13 AF0 -- SYS_SWDIO            */
#endif
    PIN_CONF(PIN(11), PINV_ALT_FUNC)    | /* PA11 AF8 -- USART6_TX            */
    PIN_CONF(PIN(1),  PINV_INPUT)       | /* PA1  INPUT MODE                  */
    PIN_CONF(PIN(0),  PINV_OUTPUT)        /* PA0  OUTPUT PUSH PULL MODE       */
  );
                                                                              /*
                 Set speed for each pin of GPIOA
                 ===============================                              */

  GPIOA->OSPEEDR = (
#ifndef SWD_DISABLED
    PIN_CONF(PIN(14), PIN_SPEED_LOW)    | /* PA14 AF0 -- SYS_SWDCLK           */
    PIN_CONF(PIN(13), PIN_SPEED_HIGHER) | /* PA13 AF0 -- SYS_SWDIO            */
#endif
    PIN_CONF(PIN(11), PIN_SPEED_LOW)    | /* PA11 AF8 -- USART6_TX            */
    PIN_CONF(PIN(0),  PIN_SPEED_LOW)      /* PA0  OUTPUT PUSH PULL            */
  );
                                                                              /*
                  Pull pins up/down if required
                  ==============================                              */

  GPIOA->PUPDR = (
#ifndef SWD_DISABLED
    PIN_CONF(PIN(14), PIN_PULL_UP)      | /* PA14 AF0 -- SYS_SWDCLK           */
    PIN_CONF(PIN(13), PIN_PULL_DOWN)    | /* PA13 AF0 -- SYS_SWDIO            */
#endif
    PIN_CONF(PIN(1),  PIN_PULL_UP)        /* PA1  INPUT PULL-UP               */
  );

  SW_PIN(C, PIN_HIGH(13));                /* SET GPIOC PIN 13 HIGH            */

  GPIOC->MODER = ALL_ANALOG - (           /* Configure GPIOC                  */
    PIN_CONF(PIN(13), PINV_OUTPUT)        /* PA13 OUTPUT PUSH-PULL            */
  );
}

__STATIC_INLINE void init_usart(uint32_t baudrate) {
  USART6->BRR = UART_BAUDRATE(100 MHZ, baudrate);
  USART6->CR1 = (
    0 * USART_CR1_SBK        | /* 0x00000001 Send Break                             */
    0 * USART_CR1_RWU        | /* 0x00000002 Receiver wakeup                        */
    0 * USART_CR1_RE         | /* 0x00000004 Receiver Enable                        */
    1 * USART_CR1_TE         | /* 0x00000008 Transmitter Enable                     */
    0 * USART_CR1_IDLEIE     | /* 0x00000010 IDLE Interrupt Enable                  */
    0 * USART_CR1_RXNEIE     | /* 0x00000020 RXNE Interrupt Enable                  */
    0 * USART_CR1_TCIE       | /* 0x00000040 Transmission Complete Interrupt Enable */
    0 * USART_CR1_TXEIE      | /* 0x00000080 TXE Interrupt Enable                   */
    0 * USART_CR1_PEIE       | /* 0x00000100 PE Interrupt Enable                    */
    0 * USART_CR1_PS         | /* 0x00000200 Parity Selection                       */
    0 * USART_CR1_PCE        | /* 0x00000400 Parity Control Enable                  */
    0 * USART_CR1_WAKE       | /* 0x00000800 Wakeup method                          */
    0 * USART_CR1_M          | /* 0x00001000 Word length                            */
    1 * USART_CR1_UE         | /* 0x00002000 USART Enable                           */
    0 * USART_CR1_OVER8        /* 0x00008000 USART Oversampling by 8 enable         */
  );
}

#if defined(__clang__) && !defined(__CC_ARM)
  #pragma clang diagnostic ignored "-Wextra-semi-stmt"
#endif

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
